<?php
/**
 * 有5个人偷了一堆苹果，准备在第二天分赃。晚上，有一人遛出来，把所有菜果分成5份，但是多了一个，顺手把这个扔给树上的猴了，自己先拿1/5藏了。
   没想到其他四人也都是这么想的，都如第一个人一样分成5份把多的那一个扔给了猴，偷走了1/5。
   第二天，大家分赃，也是分成5份多一个扔给猴了。最后一人分了一份。问：共有多少苹果？
 */


for($i=1; ;$i++) {
    if($i % 5 == 1) {
//第一次
        $t = $i - round($i/5) - 1;
        if($t % 5 == 1) {
//第二次
            $r = $t - round($t/5) - 1;
            if($r % 5 == 1) {
//第三次
                $x = $r - round($r/5) - 1;
                if($x % 5 == 1) {
//第四次
                    $y = $x - round($x/5) - 1;
                    if($y % 5 == 1) {
//第五次
                        $s = $y - round($y/5) - 1;
                        if($s % 5 == 1) {
                            echo $i;
                            break;
                        }
                    }
                }
            }
        }
    }
}
?>
